{"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1536], "dtype": "float32", "sparse": false, "ragged": false, "name": "weighted_cosine_similarity_1_input"}}, {"class_name": "Custom>WeightedCosineSimilarity", "config": {"name": "weighted_cosine_similarity_1", "trainable": true, "dtype": "float32"}}]}, "keras_version": "2.12.0", "backend": "tensorflow"}